{"id": "ex_84", "dialogue": "Honestly, my week is packed. First, I need to meet group to align on deliverables and make sure nothing slips. After that, I should attend 7am yoga class so I don’t rush later. Meanwhile, I’ll book flights for the conference, because it’s been on my mind all week. The plan is to make steady progress and not stress.", "todos": ["meet group to align on deliverables", "attend 7am yoga class", "book flights for the conference"], "topic": "school"}
{"id": "ex_83", "dialogue": "Time is tight, so I’m prioritizing a few things. First, I need to polish slides for tomorrow's presentation and make sure nothing slips. Before I forget, I should renew passport so I don’t rush later. Then, I’ll set up a brief sync with design, because it’s been on my mind all week. I’ll reward myself with a walk once I’m done.", "todos": ["polish slides for tomorrow's presentation", "renew passport", "set up a brief sync with design"], "topic": "school"}
{"id": "ex_33", "dialogue": "This list is getting long, but here’s the plan. First, I need to update roadmap in the tracker and make sure nothing slips. Plus, I should schedule haircut so I don’t rush later. And while I’m at it, I’ll schedule haircut, because it’s been on my mind all week. I’ll reward myself with a walk once I’m done.", "todos": ["update roadmap in the tracker", "schedule haircut", "schedule haircut"], "topic": "personal"}
{"id": "ex_10", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to send weekly metrics report and make sure nothing slips. Meanwhile, I should buy cat litter and food so I don’t rush later. And while I’m at it, I’ll record a short demo video for class, because it’s been on my mind all week. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["send weekly metrics report", "buy cat litter and food", "record a short demo video for class"], "topic": "work"}
{"id": "ex_65", "dialogue": "I need to get more organized today. First, I need to reconcile expenses for this month and make sure nothing slips. Also, I should meal prep for the week so I don’t rush later. On top of that, I’ll reconcile expenses for this month, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["reconcile expenses for this month", "meal prep for the week", "reconcile expenses for this month"], "topic": "work"}
{"id": "ex_63", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to send weekly metrics report and make sure nothing slips. Plus, I should schedule haircut so I don’t rush later. After that, I’ll book a dentist appointment, because it’s been on my mind all week. And while I’m at it, I’m going to schedule annual checkup and wrap things up. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["send weekly metrics report", "schedule haircut", "book a dentist appointment", "and schedule annual checkup"], "topic": "health"}
{"id": "ex_70", "dialogue": "Honestly, my week is packed. First, I need to compile data for quarterly review and make sure nothing slips. In between, I should schedule haircut so I don’t rush later. If there’s time, I’ll go for a 30-minute run, because it’s been on my mind all week. And while I’m at it, I’m going to send weekly metrics report and wrap things up. If I knock out two of these, I’ll call it a win.", "todos": ["compile data for quarterly review", "schedule haircut", "go for a 30-minute run", "and send weekly metrics report"], "topic": "work"}
{"id": "ex_24", "dialogue": "If I can focus, I can get this done. First, I need to record a short demo video for class and make sure nothing slips. In between, I should meal prep for the week so I don’t rush later. If there’s time, I’ll do laundry tonight, because it’s been on my mind all week. Then, I’m going to polish slides for tomorrow's presentation and wrap things up. I’ll keep it simple and stick to essentials.", "todos": ["record a short demo video for class", "meal prep for the week", "do laundry tonight", "and polish slides for tomorrow's presentation"], "topic": "school"}
{"id": "ex_45", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to review lecture notes for statistics and make sure nothing slips. If there’s time, I should book a dentist appointment so I don’t rush later. Before I forget, I’ll polish slides for tomorrow's presentation, because it’s been on my mind all week. I’m going to time-box each task to keep momentum.", "todos": ["review lecture notes for statistics", "book a dentist appointment", "polish slides for tomorrow's presentation"], "topic": "school"}
{"id": "ex_48", "dialogue": "Honestly, my week is packed. First, I need to set up a brief sync with design and make sure nothing slips. On top of that, I should schedule grooming appointment so I don’t rush later. On top of that, I’ll renew passport, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["set up a brief sync with design", "schedule grooming appointment", "renew passport"], "topic": "work"}
{"id": "ex_62", "dialogue": "If I can focus, I can get this done. First, I need to reconcile expenses for this month and make sure nothing slips. Plus, I should go for a 30-minute run so I don’t rush later. On top of that, I’ll draft client update email, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["reconcile expenses for this month", "go for a 30-minute run", "draft client update email"], "topic": "work"}
{"id": "ex_8", "dialogue": "Time is tight, so I’m prioritizing a few things. First, I need to set up a brief sync with design and make sure nothing slips. Meanwhile, I should meal prep for the week so I don’t rush later. Plus, I’ll take dog to the vet friday morning, because it’s been on my mind all week. Then, I’m going to buy cat litter and food and wrap things up. I’ll keep it simple and stick to essentials.", "todos": ["set up a brief sync with design", "meal prep for the week", "take dog to the vet friday morning", "and buy cat litter and food"], "topic": "pets"}
{"id": "ex_1", "dialogue": "If I can focus, I can get this done. First, I need to record a short demo video for class and make sure nothing slips. And while I’m at it, I should clean the kitchen and take out trash so I don’t rush later. If there’s time, I’ll review lecture notes for statistics, because it’s been on my mind all week. The plan is to make steady progress and not stress.", "todos": ["record a short demo video for class", "clean the kitchen and take out trash", "review lecture notes for statistics"], "topic": "school"}
{"id": "ex_38", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to review intern's progress notes and make sure nothing slips. After that, I should renew passport so I don’t rush later. And while I’m at it, I’ll order a new laptop battery, because it’s been on my mind all week. I’m going to time-box each task to keep momentum.", "todos": ["review intern's progress notes", "renew passport", "order a new laptop battery"], "topic": "personal"}
{"id": "ex_15", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to submit assignment before 11:59pm and make sure nothing slips. Plus, I should organize desk and files so I don’t rush later. And while I’m at it, I’ll renew passport, because it’s been on my mind all week. On top of that, I’m going to finish problem set for algorithms and wrap things up. Once the big rocks are done, the rest should flow.", "todos": ["submit assignment before 11:59pm", "organize desk and files", "renew passport", "and finish problem set for algorithms"], "topic": "school"}
{"id": "ex_96", "dialogue": "Time is tight, so I’m prioritizing a few things. First, I need to polish slides for tomorrow's presentation and make sure nothing slips. Also, I should renew passport so I don’t rush later. Plus, I’ll call mom after dinner, because it’s been on my mind all week. Once the big rocks are done, the rest should flow.", "todos": ["polish slides for tomorrow's presentation", "renew passport", "call mom after dinner"], "topic": "personal"}
{"id": "ex_2", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to print formula sheet at the library and make sure nothing slips. In between, I should renew passport so I don’t rush later. After that, I’ll update roadmap in the tracker, because it’s been on my mind all week. Meanwhile, I’m going to review intern's progress notes and wrap things up. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["print formula sheet at the library", "renew passport", "update roadmap in the tracker", "and review intern's progress notes"], "topic": "work"}
{"id": "ex_29", "dialogue": "This list is getting long, but here’s the plan. First, I need to record a short demo video for class and make sure nothing slips. After that, I should clean the kitchen and take out trash so I don’t rush later. On top of that, I’ll schedule grooming appointment, because it’s been on my mind all week. Before I forget, I’m going to meet group to align on deliverables and wrap things up. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["record a short demo video for class", "clean the kitchen and take out trash", "schedule grooming appointment", "and meet group to align on deliverables"], "topic": "school"}
{"id": "ex_19", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to update roadmap in the tracker and make sure nothing slips. After that, I should book a dentist appointment so I don’t rush later. Plus, I’ll meal prep for the week, because it’s been on my mind all week. I’m going to time-box each task to keep momentum.", "todos": ["update roadmap in the tracker", "book a dentist appointment", "meal prep for the week"], "topic": "work"}
{"id": "ex_98", "dialogue": "I need to get more organized today. First, I need to email professor about project scope and make sure nothing slips. On top of that, I should pick up prescription refill so I don’t rush later. Before I forget, I’ll schedule annual checkup, because it’s been on my mind all week. I’m going to time-box each task to keep momentum.", "todos": ["email professor about project scope", "pick up prescription refill", "schedule annual checkup"], "topic": "health"}
{"id": "ex_73", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to book flights for the conference and make sure nothing slips. In between, I should schedule grooming appointment so I don’t rush later. If there’s time, I’ll finish problem set for algorithms, because it’s been on my mind all week. I just need one solid focus block to get ahead.", "todos": ["book flights for the conference", "schedule grooming appointment", "finish problem set for algorithms"], "topic": "work"}
{"id": "ex_30", "dialogue": "Honestly, my week is packed. First, I need to record a short demo video for class and make sure nothing slips. After that, I should book a dentist appointment so I don’t rush later. Before I forget, I’ll set up a brief sync with design, because it’s been on my mind all week. Once the big rocks are done, the rest should flow.", "todos": ["record a short demo video for class", "book a dentist appointment", "set up a brief sync with design"], "topic": "school"}
{"id": "ex_25", "dialogue": "This list is getting long, but here’s the plan. First, I need to submit assignment before 11:59pm and make sure nothing slips. If there’s time, I should clean the kitchen and take out trash so I don’t rush later. Plus, I’ll call mom after dinner, because it’s been on my mind all week. Meanwhile, I’m going to reconcile expenses for this month and wrap things up. Once the big rocks are done, the rest should flow.", "todos": ["submit assignment before 11:59pm", "clean the kitchen and take out trash", "call mom after dinner", "and reconcile expenses for this month"], "topic": "school"}
{"id": "ex_32", "dialogue": "If I can focus, I can get this done. First, I need to compile data for quarterly review and make sure nothing slips. Plus, I should order a new laptop battery so I don’t rush later. If there’s time, I’ll reschedule physical therapy session, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["compile data for quarterly review", "order a new laptop battery", "reschedule physical therapy session"], "topic": "work"}
{"id": "ex_17", "dialogue": "I’m trying to keep everything straight. First, I need to compile data for quarterly review and make sure nothing slips. After that, I should buy cat litter and food so I don’t rush later. On top of that, I’ll email professor about project scope, because it’s been on my mind all week. The plan is to make steady progress and not stress.", "todos": ["compile data for quarterly review", "buy cat litter and food", "email professor about project scope"], "topic": "work"}
{"id": "ex_21", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to submit assignment before 11:59pm and make sure nothing slips. If there’s time, I should book a dentist appointment so I don’t rush later. On top of that, I’ll schedule grooming appointment, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["submit assignment before 11:59pm", "book a dentist appointment", "schedule grooming appointment"], "topic": "school"}
{"id": "ex_3", "dialogue": "If I can focus, I can get this done. First, I need to book flights for the conference and make sure nothing slips. Plus, I should attend 7am yoga class so I don’t rush later. After that, I’ll review lecture notes for statistics, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["book flights for the conference", "attend 7am yoga class", "review lecture notes for statistics"], "topic": "work"}
{"id": "ex_28", "dialogue": "This list is getting long, but here’s the plan. First, I need to refactor code for deep learning lab and make sure nothing slips. If there’s time, I should schedule annual checkup so I don’t rush later. And while I’m at it, I’ll take dog to the vet friday morning, because it’s been on my mind all week. Before I forget, I’m going to start literature review for final paper and wrap things up. The plan is to make steady progress and not stress.", "todos": ["refactor code for deep learning lab", "schedule annual checkup", "take dog to the vet friday morning", "and start literature review for final paper"], "topic": "school"}
{"id": "ex_12", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to finish problem set for algorithms and make sure nothing slips. Meanwhile, I should order a new laptop battery so I don’t rush later. Plus, I’ll email professor about project scope, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["finish problem set for algorithms", "order a new laptop battery", "email professor about project scope"], "topic": "school"}
{"id": "ex_9", "dialogue": "I’m trying to keep everything straight. First, I need to record a short demo video for class and make sure nothing slips. Before I forget, I should reschedule physical therapy session so I don’t rush later. Meanwhile, I’ll book a dentist appointment, because it’s been on my mind all week. In between, I’m going to record a short demo video for class and wrap things up. Small steps add up—one thing at a time.", "todos": ["record a short demo video for class", "reschedule physical therapy session", "book a dentist appointment", "and record a short demo video for class"], "topic": "school"}
{"id": "ex_81", "dialogue": "Honestly, my week is packed. First, I need to send weekly metrics report and make sure nothing slips. Before I forget, I should take dog to the vet friday morning so I don’t rush later. And while I’m at it, I’ll pick up prescription refill, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["send weekly metrics report", "take dog to the vet friday morning", "pick up prescription refill"], "topic": "work"}
{"id": "ex_7", "dialogue": "I’m trying to keep everything straight. First, I need to send weekly metrics report and make sure nothing slips. Meanwhile, I should take dog to the vet friday morning so I don’t rush later. And while I’m at it, I’ll fix bug in etl pipeline, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["send weekly metrics report", "take dog to the vet friday morning", "fix bug in etl pipeline"], "topic": "work"}
{"id": "ex_77", "dialogue": "Honestly, my week is packed. First, I need to update roadmap in the tracker and make sure nothing slips. On top of that, I should renew passport so I don’t rush later. Plus, I’ll print formula sheet at the library, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["update roadmap in the tracker", "renew passport", "print formula sheet at the library"], "topic": "work"}
{"id": "ex_86", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to start literature review for final paper and make sure nothing slips. Meanwhile, I should order a new laptop battery so I don’t rush later. In between, I’ll fix bug in etl pipeline, because it’s been on my mind all week. Before I forget, I’m going to meet group to align on deliverables and wrap things up. If I knock out two of these, I’ll call it a win.", "todos": ["start literature review for final paper", "order a new laptop battery", "fix bug in etl pipeline", "and meet group to align on deliverables"], "topic": "school"}
{"id": "ex_31", "dialogue": "This list is getting long, but here’s the plan. First, I need to email professor about project scope and make sure nothing slips. Also, I should pick up prescription refill so I don’t rush later. Also, I’ll review lecture notes for statistics, because it’s been on my mind all week. And while I’m at it, I’m going to start literature review for final paper and wrap things up. The plan is to make steady progress and not stress.", "todos": ["email professor about project scope", "pick up prescription refill", "review lecture notes for statistics", "and start literature review for final paper"], "topic": "school"}
{"id": "ex_67", "dialogue": "Honestly, my week is packed. First, I need to meet group to align on deliverables and make sure nothing slips. And while I’m at it, I should schedule grooming appointment so I don’t rush later. Plus, I’ll order a new laptop battery, because it’s been on my mind all week. Once the big rocks are done, the rest should flow.", "todos": ["meet group to align on deliverables", "schedule grooming appointment", "order a new laptop battery"], "topic": "school"}
{"id": "ex_66", "dialogue": "If I can focus, I can get this done. First, I need to print formula sheet at the library and make sure nothing slips. Plus, I should book a dentist appointment so I don’t rush later. Plus, I’ll go grocery shopping, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["print formula sheet at the library", "book a dentist appointment", "go grocery shopping"], "topic": "school"}
{"id": "ex_27", "dialogue": "Honestly, my week is packed. First, I need to email professor about project scope and make sure nothing slips. And while I’m at it, I should order a new laptop battery so I don’t rush later. Meanwhile, I’ll take dog to the vet friday morning, because it’s been on my mind all week. I’ll reward myself with a walk once I’m done.", "todos": ["email professor about project scope", "order a new laptop battery", "take dog to the vet friday morning"], "topic": "school"}
{"id": "ex_39", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to submit assignment before 11:59pm and make sure nothing slips. On top of that, I should do laundry tonight so I don’t rush later. On top of that, I’ll polish slides for tomorrow's presentation, because it’s been on my mind all week. Before I forget, I’m going to clean the kitchen and take out trash and wrap things up. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["submit assignment before 11:59pm", "do laundry tonight", "polish slides for tomorrow's presentation", "and clean the kitchen and take out trash"], "topic": "school"}
{"id": "ex_85", "dialogue": "I need to get more organized today. First, I need to fix bug in etl pipeline and make sure nothing slips. Before I forget, I should schedule grooming appointment so I don’t rush later. Meanwhile, I’ll call mom after dinner, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["fix bug in etl pipeline", "schedule grooming appointment", "call mom after dinner"], "topic": "work"}
{"id": "ex_95", "dialogue": "Time is tight, so I’m prioritizing a few things. First, I need to polish slides for tomorrow's presentation and make sure nothing slips. Meanwhile, I should pay rent so I don’t rush later. Also, I’ll schedule grooming appointment, because it’s been on my mind all week. Meanwhile, I’m going to email professor about project scope and wrap things up. I’ll keep it simple and stick to essentials.", "todos": ["polish slides for tomorrow's presentation", "pay rent", "schedule grooming appointment", "and email professor about project scope"], "topic": "school"}
{"id": "ex_41", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to print formula sheet at the library and make sure nothing slips. Before I forget, I should schedule haircut so I don’t rush later. Also, I’ll meet group to align on deliverables, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["print formula sheet at the library", "schedule haircut", "meet group to align on deliverables"], "topic": "school"}
{"id": "ex_20", "dialogue": "This list is getting long, but here’s the plan. First, I need to finish problem set for algorithms and make sure nothing slips. In between, I should call mom after dinner so I don’t rush later. And while I’m at it, I’ll pay rent, because it’s been on my mind all week. Meanwhile, I’m going to review lecture notes for statistics and wrap things up. I’m going to time-box each task to keep momentum.", "todos": ["finish problem set for algorithms", "call mom after dinner", "pay rent", "and review lecture notes for statistics"], "topic": "school"}
{"id": "ex_74", "dialogue": "I’m trying to keep everything straight. First, I need to start literature review for final paper and make sure nothing slips. Also, I should attend 7am yoga class so I don’t rush later. And while I’m at it, I’ll renew passport, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["start literature review for final paper", "attend 7am yoga class", "renew passport"], "topic": "school"}
{"id": "ex_92", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to meet group to align on deliverables and make sure nothing slips. Meanwhile, I should buy cat litter and food so I don’t rush later. Meanwhile, I’ll meal prep for the week, because it’s been on my mind all week. I just need one solid focus block to get ahead.", "todos": ["meet group to align on deliverables", "buy cat litter and food", "meal prep for the week"], "topic": "school"}
{"id": "ex_82", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to send weekly metrics report and make sure nothing slips. If there’s time, I should schedule grooming appointment so I don’t rush later. On top of that, I’ll polish slides for tomorrow's presentation, because it’s been on my mind all week. In between, I’m going to attend 7am yoga class and wrap things up. The plan is to make steady progress and not stress.", "todos": ["send weekly metrics report", "schedule grooming appointment", "polish slides for tomorrow's presentation", "and attend 7am yoga class"], "topic": "work"}
{"id": "ex_94", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to finish problem set for algorithms and make sure nothing slips. Before I forget, I should schedule annual checkup so I don’t rush later. Also, I’ll take dog to the vet friday morning, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["finish problem set for algorithms", "schedule annual checkup", "take dog to the vet friday morning"], "topic": "school"}
{"id": "ex_56", "dialogue": "This list is getting long, but here’s the plan. First, I need to set up a brief sync with design and make sure nothing slips. Meanwhile, I should schedule grooming appointment so I don’t rush later. If there’s time, I’ll refactor code for deep learning lab, because it’s been on my mind all week. The plan is to make steady progress and not stress.", "todos": ["set up a brief sync with design", "schedule grooming appointment", "refactor code for deep learning lab"], "topic": "work"}
{"id": "ex_18", "dialogue": "Time is tight, so I’m prioritizing a few things. First, I need to update roadmap in the tracker and make sure nothing slips. If there’s time, I should attend 7am yoga class so I don’t rush later. If there’s time, I’ll book flights for the conference, because it’s been on my mind all week. Meanwhile, I’m going to start literature review for final paper and wrap things up. Small steps add up—one thing at a time.", "todos": ["update roadmap in the tracker", "attend 7am yoga class", "book flights for the conference", "and start literature review for final paper"], "topic": "work"}
{"id": "ex_40", "dialogue": "I’m trying to keep everything straight. First, I need to set up a brief sync with design and make sure nothing slips. Meanwhile, I should take dog to the vet friday morning so I don’t rush later. And while I’m at it, I’ll schedule haircut, because it’s been on my mind all week. I just need one solid focus block to get ahead.", "todos": ["set up a brief sync with design", "take dog to the vet friday morning", "schedule haircut"], "topic": "work"}
{"id": "ex_50", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to review intern's progress notes and make sure nothing slips. After that, I should pick up prescription refill so I don’t rush later. On top of that, I’ll set up a brief sync with design, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["review intern's progress notes", "pick up prescription refill", "set up a brief sync with design"], "topic": "work"}
{"id": "ex_43", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to send weekly metrics report and make sure nothing slips. If there’s time, I should go grocery shopping so I don’t rush later. On top of that, I’ll review intern's progress notes, because it’s been on my mind all week. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["send weekly metrics report", "go grocery shopping", "review intern's progress notes"], "topic": "work"}
{"id": "ex_100", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to compile data for quarterly review and make sure nothing slips. On top of that, I should go for a 30-minute run so I don’t rush later. And while I’m at it, I’ll schedule grooming appointment, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["compile data for quarterly review", "go for a 30-minute run", "schedule grooming appointment"], "topic": "work"}
{"id": "ex_44", "dialogue": "I’m trying to keep everything straight. First, I need to print formula sheet at the library and make sure nothing slips. Before I forget, I should organize desk and files so I don’t rush later. Meanwhile, I’ll compile data for quarterly review, because it’s been on my mind all week. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["print formula sheet at the library", "organize desk and files", "compile data for quarterly review"], "topic": "school"}
{"id": "ex_71", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to print formula sheet at the library and make sure nothing slips. Also, I should book a dentist appointment so I don’t rush later. If there’s time, I’ll finish problem set for algorithms, because it’s been on my mind all week. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["print formula sheet at the library", "book a dentist appointment", "finish problem set for algorithms"], "topic": "school"}
{"id": "ex_16", "dialogue": "If I can focus, I can get this done. First, I need to prepare agenda for team stand-up and make sure nothing slips. And while I’m at it, I should clean the kitchen and take out trash so I don’t rush later. Then, I’ll book flights for the conference, because it’s been on my mind all week. I’ll keep it simple and stick to essentials.", "todos": ["prepare agenda for team stand-up", "clean the kitchen and take out trash", "book flights for the conference"], "topic": "work"}
{"id": "ex_34", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to review lecture notes for statistics and make sure nothing slips. On top of that, I should book a dentist appointment so I don’t rush later. Also, I’ll pay rent, because it’s been on my mind all week. Plus, I’m going to prepare agenda for team stand-up and wrap things up. I’m going to time-box each task to keep momentum.", "todos": ["review lecture notes for statistics", "book a dentist appointment", "pay rent", "and prepare agenda for team stand-up"], "topic": "school"}
{"id": "ex_54", "dialogue": "If I can focus, I can get this done. First, I need to draft client update email and make sure nothing slips. Plus, I should clean the kitchen and take out trash so I don’t rush later. Meanwhile, I’ll prepare agenda for team stand-up, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["draft client update email", "clean the kitchen and take out trash", "prepare agenda for team stand-up"], "topic": "work"}
{"id": "ex_68", "dialogue": "I’m trying to keep everything straight. First, I need to email professor about project scope and make sure nothing slips. And while I’m at it, I should clean the kitchen and take out trash so I don’t rush later. Then, I’ll email professor about project scope, because it’s been on my mind all week. On top of that, I’m going to draft client update email and wrap things up. The plan is to make steady progress and not stress.", "todos": ["email professor about project scope", "clean the kitchen and take out trash", "email professor about project scope", "and draft client update email"], "topic": "school"}
{"id": "ex_26", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to review intern's progress notes and make sure nothing slips. After that, I should organize desk and files so I don’t rush later. After that, I’ll update roadmap in the tracker, because it’s been on my mind all week. I’ll reward myself with a walk once I’m done.", "todos": ["review intern's progress notes", "organize desk and files", "update roadmap in the tracker"], "topic": "work"}
{"id": "ex_58", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to review intern's progress notes and make sure nothing slips. Meanwhile, I should pick up prescription refill so I don’t rush later. And while I’m at it, I’ll compile data for quarterly review, because it’s been on my mind all week. If there’s time, I’m going to order a new laptop battery and wrap things up. I’m going to time-box each task to keep momentum.", "todos": ["review intern's progress notes", "pick up prescription refill", "compile data for quarterly review", "and order a new laptop battery"], "topic": "work"}
{"id": "ex_13", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to fix bug in etl pipeline and make sure nothing slips. If there’s time, I should book a dentist appointment so I don’t rush later. Also, I’ll fix bug in etl pipeline, because it’s been on my mind all week. In between, I’m going to reconcile expenses for this month and wrap things up. I’ll reward myself with a walk once I’m done.", "todos": ["fix bug in etl pipeline", "book a dentist appointment", "fix bug in etl pipeline", "and reconcile expenses for this month"], "topic": "work"}
{"id": "ex_97", "dialogue": "I need to get more organized today. First, I need to email professor about project scope and make sure nothing slips. In between, I should order a new laptop battery so I don’t rush later. On top of that, I’ll organize desk and files, because it’s been on my mind all week. Then, I’m going to take dog to the vet friday morning and wrap things up. I’ll reward myself with a walk once I’m done.", "todos": ["email professor about project scope", "order a new laptop battery", "organize desk and files", "and take dog to the vet friday morning"], "topic": "personal"}
{"id": "ex_75", "dialogue": "I need to get more organized today. First, I need to prepare agenda for team stand-up and make sure nothing slips. Also, I should organize desk and files so I don’t rush later. After that, I’ll update roadmap in the tracker, because it’s been on my mind all week. Then, I’m going to review intern's progress notes and wrap things up. I’ll keep it simple and stick to essentials.", "todos": ["prepare agenda for team stand-up", "organize desk and files", "update roadmap in the tracker", "and review intern's progress notes"], "topic": "work"}
{"id": "ex_69", "dialogue": "Today’s a bit chaotic, but manageable. First, I need to start literature review for final paper and make sure nothing slips. Before I forget, I should organize desk and files so I don’t rush later. Also, I’ll organize desk and files, because it’s been on my mind all week. Before I forget, I’m going to take dog to the vet friday morning and wrap things up. I’m going to time-box each task to keep momentum.", "todos": ["start literature review for final paper", "organize desk and files", "organize desk and files", "and take dog to the vet friday morning"], "topic": "personal"}
{"id": "ex_87", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to book flights for the conference and make sure nothing slips. Also, I should meal prep for the week so I don’t rush later. After that, I’ll print formula sheet at the library, because it’s been on my mind all week. Plus, I’m going to refactor code for deep learning lab and wrap things up. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["book flights for the conference", "meal prep for the week", "print formula sheet at the library", "and refactor code for deep learning lab"], "topic": "school"}
{"id": "ex_37", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to set up a brief sync with design and make sure nothing slips. And while I’m at it, I should book a dentist appointment so I don’t rush later. Before I forget, I’ll review lecture notes for statistics, because it’s been on my mind all week. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["set up a brief sync with design", "book a dentist appointment", "review lecture notes for statistics"], "topic": "work"}
{"id": "ex_79", "dialogue": "I’m trying to keep everything straight. First, I need to review lecture notes for statistics and make sure nothing slips. Meanwhile, I should call mom after dinner so I don’t rush later. Also, I’ll finish problem set for algorithms, because it’s been on my mind all week. On top of that, I’m going to fix bug in etl pipeline and wrap things up. I’ll batch similar tasks so it doesn’t feel so heavy.", "todos": ["review lecture notes for statistics", "call mom after dinner", "finish problem set for algorithms", "and fix bug in etl pipeline"], "topic": "school"}
{"id": "ex_22", "dialogue": "I’m trying to keep everything straight. First, I need to update roadmap in the tracker and make sure nothing slips. Also, I should schedule haircut so I don’t rush later. After that, I’ll reconcile expenses for this month, because it’s been on my mind all week. I just need one solid focus block to get ahead.", "todos": ["update roadmap in the tracker", "schedule haircut", "reconcile expenses for this month"], "topic": "work"}
{"id": "ex_99", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to update roadmap in the tracker and make sure nothing slips. On top of that, I should schedule grooming appointment so I don’t rush later. Before I forget, I’ll update roadmap in the tracker, because it’s been on my mind all week. I’m going to time-box each task to keep momentum.", "todos": ["update roadmap in the tracker", "schedule grooming appointment", "update roadmap in the tracker"], "topic": "work"}
{"id": "ex_78", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to set up a brief sync with design and make sure nothing slips. In between, I should go grocery shopping so I don’t rush later. Meanwhile, I’ll go for a 30-minute run, because it’s been on my mind all week. Also, I’m going to go grocery shopping and wrap things up. I’ll reward myself with a walk once I’m done.", "todos": ["set up a brief sync with design", "go grocery shopping", "go for a 30-minute run", "and go grocery shopping"], "topic": "personal"}
{"id": "ex_42", "dialogue": "If I can focus, I can get this done. First, I need to refactor code for deep learning lab and make sure nothing slips. In between, I should schedule annual checkup so I don’t rush later. If there’s time, I’ll compile data for quarterly review, because it’s been on my mind all week. If there’s time, I’m going to set up a brief sync with design and wrap things up. I’ll reward myself with a walk once I’m done.", "todos": ["refactor code for deep learning lab", "schedule annual checkup", "compile data for quarterly review", "and set up a brief sync with design"], "topic": "work"}
{"id": "ex_23", "dialogue": "I’ve been procrastinating, but I’m turning it around. First, I need to fix bug in etl pipeline and make sure nothing slips. Plus, I should go grocery shopping so I don’t rush later. And while I’m at it, I’ll schedule haircut, because it’s been on my mind all week. The plan is to make steady progress and not stress.", "todos": ["fix bug in etl pipeline", "go grocery shopping", "schedule haircut"], "topic": "personal"}
{"id": "ex_80", "dialogue": "Honestly, my week is packed. First, I need to review intern's progress notes and make sure nothing slips. After that, I should take dog to the vet friday morning so I don’t rush later. If there’s time, I’ll update roadmap in the tracker, because it’s been on my mind all week. On top of that, I’m going to go for a 30-minute run and wrap things up. If I knock out two of these, I’ll call it a win.", "todos": ["review intern's progress notes", "take dog to the vet friday morning", "update roadmap in the tracker", "and go for a 30-minute run"], "topic": "work"}
{"id": "ex_91", "dialogue": "I want to front-load the hard stuff and coast later. First, I need to print formula sheet at the library and make sure nothing slips. Before I forget, I should reschedule physical therapy session so I don’t rush later. In between, I’ll review lecture notes for statistics, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["print formula sheet at the library", "reschedule physical therapy session", "review lecture notes for statistics"], "topic": "school"}
{"id": "ex_46", "dialogue": "This list is getting long, but here’s the plan. First, I need to finish problem set for algorithms and make sure nothing slips. On top of that, I should renew passport so I don’t rush later. Also, I’ll print formula sheet at the library, because it’s been on my mind all week. I just need one solid focus block to get ahead.", "todos": ["finish problem set for algorithms", "renew passport", "print formula sheet at the library"], "topic": "school"}
{"id": "ex_89", "dialogue": "This list is getting long, but here’s the plan. First, I need to send weekly metrics report and make sure nothing slips. Plus, I should call mom after dinner so I don’t rush later. In between, I’ll submit assignment before 11:59pm, because it’s been on my mind all week. I’m blocking off an hour with my phone on do-not-disturb.", "todos": ["send weekly metrics report", "call mom after dinner", "submit assignment before 11:59pm"], "topic": "work"}
{"id": "ex_11", "dialogue": "If I can focus, I can get this done. First, I need to review intern's progress notes and make sure nothing slips. After that, I should do laundry tonight so I don’t rush later. On top of that, I’ll email professor about project scope, because it’s been on my mind all week. Small steps add up—one thing at a time.", "todos": ["review intern's progress notes", "do laundry tonight", "email professor about project scope"], "topic": "work"}
{"id": "ex_72", "dialogue": "I’m aiming for steady progress instead of perfection. First, I need to refactor code for deep learning lab and make sure nothing slips. Also, I should do laundry tonight so I don’t rush later. Meanwhile, I’ll update roadmap in the tracker, because it’s been on my mind all week. I’ll reward myself with a walk once I’m done.", "todos": ["refactor code for deep learning lab", "do laundry tonight", "update roadmap in the tracker"], "topic": "school"}
{"id": "ex_76", "dialogue": "If I can focus, I can get this done. First, I need to refactor code for deep learning lab and make sure nothing slips. Also, I should attend 7am yoga class so I don’t rush later. Also, I’ll start literature review for final paper, because it’s been on my mind all week. If I knock out two of these, I’ll call it a win.", "todos": ["refactor code for deep learning lab", "attend 7am yoga class", "start literature review for final paper"], "topic": "school"}
